config/emacs.d/config.org
#+title Emacs do zero
#+author Ulisses Silva

** Conteúdo do init.el

#+begin_example
(org-babel-load-file
   (expand-file-name "config.org" user-emacs-directory))
#+end_example

** Configurações do emacs

*** Configurações inicias do emacs

#+begin_src emacs-lisp

   (setq inhibit-startup-message t)

  (tool-bar-mode -1)
  (menu-bar-mode 1)
  (scroll-bar-mode -1)
  (tooltip-mode nil)

  (global-display-line-numbers-mode t)
  (column-number-mode t)
  (global-hl-line-mode t)

  ;; alerta visual
  (setq visible-bell t)

  ;; espaçamento das bordas laterais
  (set-fringe-mode 10)

  ;; espaços ao invés de tabs
  (setq-default indent-tabs-mode nil)

  ;; habilita o fechamento de pares
  (electric-pair-mode 1)

  ;; sai do mini buffer com esc
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

*** Ajustes que facilitam o emacs

#+begin_src emacs-lisp
  ;; ajustes para facilitar
  (global-unset-key (kbd "C-z")) ;; desabilita o suspend-frame (C-z)
  (delete-selection-mode t) ;; o texto digitado substitui a seleção

  ;; Rolagem mais suave
  (setq mouse-wheel-scroll-amount '(5 ((shift) . 1)) ;; 2 linhas por vez
  	  mouse-wheel-progressive-speed nil ;; Não acelera a rolagem
  	  mouse-wheel-follow-mouse 't ;; rola a janela do mouse
  	  scroll-step 5 ;; rola 1 linha com teclado
  	  )

  ;; Quebras de linha
  (global-visual-line-mode 1)

  ;; Organizando backups
  (setq backup-directory-alist `(("." . "~/.emacs-backups-files")))

  #+end_src

*** Tema de cores do emacs

#+begin_example
  ;; adiciona um tema temporario
  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes")
  (load-theme 'dracula t)

#+end_example

*** Configurações visuais

#+begin_src emacs-lisp
  (setq-default cursor-type 'bar)

  (set-face-attribute 'default nil :font "Hasklug Nerd Font Mono" :height 150)

#+end_src

*** Buffer inicial do emacs

#+begin_src emacs-lisp
  ;; Função para criar um novo buffer
  (defun silver-new-buffer ()
    "cria um novo buffer `sem nome`"
    (interactive)
    (let (silver/buf (generate-new-buffer "sem-nome")))
    (switch-to-buffer silver/buf)
    (funcall initial-major-mode)
    (setq buffer-offer-save t)
    silver/buf)

  ;; modo inicial
  (setq initial-major-mode 'prog-mode)
  (setq initial-buffer-choice 'silver-new-buffer)

#+end_src

** Pacotes do emacs
*** Inicialização do gerenciador de pacotes

#+begin_example
  ;; verifica e inicia o package.el
  (require 'package)

  (add-to-list 'package-archives
               '("melpa" . "https://melpa.org/packages/") t)
  ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
  ;; and `package-pinned-packages`. Most users will not need or want to do this.
  ;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_example

*** Instala o use-package

#+begin_example
  
  ;; baixa o use-package
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

  ;; atualização automatica de pacotes
  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "22:00")
    )

#+end_example

*** Instala o straight.el para gerenciar os pacotes

#+begin_src emacs-lisp

  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))


  (setq package-enable-at-startup nil)

#+end_src

*** Instala os pacotes via straight.el

#+begin_src emacs-lisp
  
(straight-use-package 'el-patch)

#+end_src

*** Instala o use-package via stright.el

#+begin_src emacs-lisp
    
  (straight-use-package 'use-package)

  (setq straight-use-package-by-default t)


#+end_src

*** Raibow mode

#+begin_src emacs-lisp
  
(use-package rainbow-mode
  :diminish
  :hook org-mode prog-mode)

#+end_src

*** Evil mode
#+begin_example

(use-package evil
    :init
    (setq evil-want-integration t
          evil-want-keybinding nil
          evil-vsplit-window-right t
          evil-split-window-below t
          evil-undo-system 'undo-redo)
    (evil-mode))

(use-package evil-collection
  :after evil
  :config
  (add-to-list 'evil-collection-mode-list 'help) ;; evilify help mode
  (evil-collection-init))

#+end_example

*** Diminish

#+begin_src emacs-lisp

  (use-package diminish)

#+end_src

*** Marginalia

#+begin_src emacs-lisp

;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))

#+end_src

*** All-the-icons-completion

#+begin_src emacs-lisp

  (use-package all-the-icons-completion
  :after (marginalia all-the-icons)
  :hook (marginalia-mode . all-the-icons-completion-marginalia-setup)
  :init
  (all-the-icons-completion-mode))


#+end_src

*** Vertico

#+begin_src emacs-lisp

;; Enable Vertico.
(use-package vertico
  :custom
   (vertico-scroll-margin 0) ;; Different scroll margin
   (vertico-count 20) ;; Show more candidates
   (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
   (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
  :init
  (vertico-mode))

#+end_src

*** Alguns pacotes para complementar o vertico
  
#+begin_src emacs-lisp
  ;; Persist history over Emacs restarts. Vertico sorts by history position.
  (use-package savehist
    :init
    (savehist-mode))

  ;; Emacs minibuffer configurations.
  (use-package emacs
    :custom
    ;; Enable context menu. `vertico-multiform-mode' adds a menu in the minibuffer
    ;; to switch display modes.
    (context-menu-mode t)
    ;; Support opening new minibuffers from inside existing minibuffers.
    (enable-recursive-minibuffers t)
    ;; Hide commands in M-x which do not work in the current mode.  Vertico
    ;; commands are hidden in normal buffers. This setting is useful beyond
    ;; Vertico.
    (read-extended-command-predicate #'command-completion-default-include-p)
    ;; Do not allow the cursor in the minibuffer prompt
    (minibuffer-prompt-properties
     '(read-only t cursor-intangible t face minibuffer-prompt)))

#+end_src

*** Oderless

#+begin_src emacs-lisp
(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles partial-completion))))
  (completion-pcm-leading-wildcard t)) ;; Emacs 31: partial-completion behaves like substring
#+end_src

*** Consult

#+begin_src emacs-lisp

   (use-package consult)

#+end_src

** Flycheck
#+begin_src emacs-lisp

  (use-package flycheck
  :ensure t
  :init (global-flycheck-mode))

#+end_src

*** Company mode

#+begin_src emacs-lisp
(use-package company
  :defer 2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .1)
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t)) 

(use-package company-box
  :after company
  :diminish
  :hook (company-mode . company-box-mode))
#+end_src

*** Doom themes
#+begin_src emacs-lisp

  (use-package doom-themes
  :ensure t
  :custom
  ;; Global settings (defaults)
  (doom-themes-enable-bold t)   ; if nil, bold is universally disabled
  (doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; for treemacs users
  (doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  :config
  (load-theme 'doom-tokyo-night t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (nerd-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

*** Doom modeline

#+begin_src emacs-lisp

  (use-package nerd-icons
  ;; :custom
  ;; The Nerd Font you want to use in GUI
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
  )

  (use-package doom-modeline
  :ensure t
  :hook (after-init . doom-modeline-mode))

#+end_src

*** Magit

#+begin_src emacs-lisp

  (use-package magit)

#+end_src

*** Project title
#+begin_src emacs-lisp

  (use-package diminish)

  (use-package projectile
  :diminish projectile-mode
  :config
  (projectile-mode))
#+end_src

*** Treemacs

#+begin_example

    (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-buffer-name-function            #'treemacs-default-buffer-name
            treemacs-buffer-name-prefix              " *Treemacs-Buffer-"
            treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
            treemacs-deferred-git-apply-delay        0.5
            treemacs-directory-name-transformer      #'identity
            treemacs-display-in-side-window          t
            treemacs-eldoc-display                   'simple
            treemacs-file-event-delay                2000
            treemacs-file-extension-regex            treemacs-last-period-regex-value
            treemacs-file-follow-delay               0.2
            treemacs-file-name-transformer           #'identity
            treemacs-follow-after-init               t
            treemacs-expand-after-init               t
            treemacs-find-workspace-method           'find-for-file-or-pick-first
            treemacs-git-command-pipe                ""
            treemacs-goto-tag-strategy               'refetch-index
            treemacs-header-scroll-indicators        '(nil . "^^^^^^")
            treemacs-hide-dot-git-directory          t
            treemacs-indentation                     2
            treemacs-indentation-string              " "
            treemacs-is-never-other-window           nil
            treemacs-max-git-entries                 5000
            treemacs-missing-project-action          'ask
            treemacs-move-files-by-mouse-dragging    t
            treemacs-move-forward-on-expand          nil
            treemacs-no-png-images                   nil
            treemacs-no-delete-other-windows         t
            treemacs-project-follow-cleanup          nil
  ;;          treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
            treemacs-position                        'left
            treemacs-read-string-input               'from-child-frame
            treemacs-recenter-distance               0.1
            treemacs-recenter-after-file-follow      nil
            treemacs-recenter-after-tag-follow       nil
            treemacs-recenter-after-project-jump     'always
            treemacs-recenter-after-project-expand   'on-distance
            treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
            treemacs-project-follow-into-home        nil
            treemacs-show-cursor                     nil
            treemacs-show-hidden-files               t
            treemacs-silent-filewatch                nil
            treemacs-silent-refresh                  nil
            treemacs-sorting                         'alphabetic-asc
            treemacs-select-when-already-in-treemacs 'move-back
            treemacs-space-between-root-nodes        t
            treemacs-tag-follow-cleanup              t
            treemacs-tag-follow-delay                1.5
            treemacs-text-scale                      nil
            treemacs-user-mode-line-format           nil
            treemacs-user-header-line-format         nil
            treemacs-wide-toggle-width               70
            treemacs-width                           35
            treemacs-width-increment                 1
            treemacs-width-is-initially-locked       t
            treemacs-workspace-switch-cleanup        nil
            treemacs-never-persist                   t  )

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (when treemacs-python-executable
        (treemacs-git-commit-diff-mode t))

      (pcase (cons (not (null (executable-find "git")))
                   (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode nil))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once)
    :ensure t)

  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)

  (use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
    :after (treemacs persp-mode) ;;or perspective vs. persp-mode
    :ensure t
    :config (treemacs-set-scope-type 'Perspectives))

  (use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
    :after (treemacs)
    :ensure t
    :config (treemacs-set-scope-type 'Tabs))

  (treemacs-start-on-boot)

#+end_example


*** Lsp

#+begin_src emacs-lisp
  (use-package lsp-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
         (python-mode . lsp)
         ;; if you want which-key integration
         (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

;; optionally
(use-package lsp-ui :commands lsp-ui-mode)
;; if you are helm user
;; (use-package helm-lsp :commands helm-lsp-workspace-symbol)
;; if you are ivy user
;; (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; optionally if you want to use debugger
(use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language

;; optional if you want which-key integration
(use-package which-key
    :config
    (which-key-mode))
#+end_src

*** Neotree

#+begin_src emacs-lisp

  (add-to-list 'load-path "~/.emacs.d/neotree")
  (require 'neotree)
  (setq neo-smart-open t)
  (global-set-key [f8] 'neotree-toggle)

  ;; adiciona o projecttile com o neotree
    (defun neotree-project-dir ()
    "Open NeoTree using the git root."
    (interactive)
    (let ((project-dir (projectile-project-root))
          (file-name (buffer-file-name)))
      (neotree-toggle)
      (if project-dir
          (if (neo-global--window-exists-p)
              (progn
                (neotree-dir project-dir)
                (neotree-find file-name)))
        (message "Could not find git project root."))))

   (global-set-key [f7] 'neotree-project-dir)

#+end_src

#+begin_src emacs-lisp
#+end_src

#+begin_src emacs-lisp
#+end_src

#+begin_src emacs-lisp
#+end_src

#+begin_src emacs-lisp
#+end_src























































































